#----------------------------Пример 1------------------------------------------
def sq(x):
    return x**2  #дарачаи 2-ва мебардорад

a = [5, 4, 8, 4]

b = list(map(sq, a)) # мап худди for i in range боин хар як элементи списоки а-я мебенад
print(b)
#------------------------------------------------------------------------------------

#-------------------------------------Пример 2---------------------------------------#


a = ["how", "id", "name", "Hello"]
print(list(map(str.upper, a))) # map хар як элементи списока регистраша калон кард
